import { IBlogItem } from '@/interfaces/BlogItem.interface'

import postOne from '@/assets/post-1.jpg'

export const MBlogItem: IBlogItem[] = [
  {
    _id: '1',
    title: 'Труднощі у навчанні діагностичного мислення в цифрову епоху: критична роль викладача-клініциста-наставника',
    description:
      'Спеціалізується на загальній та баріатричній хірургії, всіх малоінвазивних методах. Старший загальний хірург та керівник відділення баріатричної хірургії. Приватна лікарня преміум-класу, надає медичну допомогу найвищої якості, індивідуальне лікування від провідних фахівців країни та в найкоротші терміни.',
    image: postOne,
    createdAt: '2025-01-01T00:00:00.000Z',
    updatedAt: '2025-01-02T00:00:00.000Z'
  },
  {
    _id: '2',
    title: 'Труднощі у навчанні діагностичного мислення в цифрову епоху: критична роль викладача-клініциста-наставника',
    description:
      'Спеціалізується на загальній та баріатричній хірургії, всіх малоінвазивних методах. Старший загальний хірург та керівник відділення баріатричної хірургії. Приватна лікарня преміум-класу, надає медичну допомогу найвищої якості, індивідуальне лікування від провідних фахівців країни та в найкоротші терміни.',
    image: postOne,
    createdAt: '2025-01-01T00:00:00.000Z',
    updatedAt: '2025-01-02T00:00:00.000Z'
  },
  {
    _id: '3',
    title: 'Труднощі у навчанні діагностичного мислення в цифрову епоху: критична роль викладача-клініциста-наставника',
    description:
      'Спеціалізується на загальній та баріатричній хірургії, всіх малоінвазивних методах. Старший загальний хірург та керівник відділення баріатричної хірургії. Приватна лікарня преміум-класу, надає медичну допомогу найвищої якості, індивідуальне лікування від провідних фахівців країни та в найкоротші терміни.',
    image: postOne,
    createdAt: '2025-01-01T00:00:00.000Z',
    updatedAt: '2025-01-02T00:00:00.000Z'
  }
]
